<a href="https://colab.research.google.com/github/gitmystuff/DTSC5810/blob/main/Week_03-Data_Organization/SQL_I.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL I

## Database

In computing, a database is an organized collection of data or a type of data store based on the use of a database management system (DBMS), the software that interacts with end users, applications, and the database itself to capture and analyze the data. The DBMS additionally encompasses the core facilities provided to administer the database. The sum total of the database, the DBMS and the associated applications can be referred to as a database system. Often the term "database" is also used loosely to refer to any of the DBMS, the database system or an application associated with the database.

https://en.wikipedia.org/wiki/Database

## SQL

SQL, Structured Query Language, is a domain-specific language used in programming and designed for managing data held in a relational database management system (RDBMS), or for stream processing in a relational data stream management system (RDSMS). It is particularly useful in handling structured data, i.e. data incorporating relations among entities and variables.

The SQL language is subdivided into several language elements, including:

* Clauses, which are constituent components of statements and queries. (In some cases, these are optional.)[17]
* Expressions, which can produce either scalar values, or tables consisting of columns and rows of data
* Predicates, which specify conditions that can be evaluated to SQL three-valued logic (3VL) (true/false/unknown) or Boolean truth values and are used to limit the effects of statements and queries, or to change program flow.
* Queries, which retrieve the data based on specific criteria. This is an important element of SQL.
* Statements, which may have a persistent effect on schemata and data, or may control transactions, program flow, connections, sessions, or diagnostics.
* SQL statements also include the semicolon (";") statement terminator. Though not required on every platform, it is defined as a standard part of the SQL grammar.
* Insignificant whitespace is generally ignored in SQL statements and queries, making it easier to format SQL code for readability.
<br /><br />

<img src='https://wikimedia.org/api/rest_v1/media/math/render/svg/b83ad563285f7b0ebb325226d91f25ca0bffa7cd' alt='example of sql language elements'/>

https://en.wikipedia.org/wiki/SQL

A NoSQL (originally referring to "non-SQL" or "non-relational", "not only sql") database provides a mechanism for storage and retrieval of data that is modeled in means other than the tabular relations used in relational databases. Such databases have existed since the late 1960s, but the name "NoSQL" was only coined in the early 21st century, triggered by the needs of Web 2.0 companies. NoSQL databases are increasingly used in big data and real-time web applications. NoSQL systems are also sometimes called Not only SQL to emphasize that they may support SQL-like query languages or sit alongside SQL databases in polyglot-persistent architectures.

Motivations for this approach include simplicity of design, simpler "horizontal" scaling to clusters of machines (which is a problem for relational databases), finer control over availability and limiting the object-relational impedance mismatch. The data structures used by NoSQL databases (e.g. keyâ€“value pair, wide column, graph, or document) are different from those used by default in relational databases, making some operations faster in NoSQL. The particular suitability of a given NoSQL database depends on the problem it must solve. Sometimes the data structures used by NoSQL databases are also viewed as "more flexible" than relational database tables.

Many NoSQL stores compromise consistency (in the sense of the CAP theorem) in favor of availability, partition tolerance, and speed. Barriers to the greater adoption of NoSQL stores include the use of low-level query languages (instead of SQL, for instance), lack of ability to perform ad hoc joins across tables, lack of standardized interfaces, and huge previous investments in existing relational databases. Most NoSQL stores lack true ACID transactions, although a few databases have made them central to their designs.

https://en.wikipedia.org/wiki/NoSQL

Relational to NoSQL at Enterprise Scale: Lessons from Amazon: https://thenewstack.io/relational-to-nosql-at-enterprise-scale-lessons-from-amazon/

* https://www.analyticsvidhya.com/blog/2022/06/an-introduction-to-joins-in-mysql/
* https://towardsdatascience.com/how-to-run-sql-queries-from-a-jupyter-notebook-aaa18e59e7bc
* https://www.digitalocean.com/community/tutorials/how-to-use-the-sqlite3-module-in-python-3

## SQL Terms

* https://www.w3schools.com/sql/default.asp
* CRUD
* Primary key
* Foreign key
* Data types: https://www.w3schools.com/sql/sql_datatypes.asp

## SQL Alchemy

* https://www.sqlalchemy.org/

## Magic

* https://jakevdp.github.io/PythonDataScienceHandbook/01.03-magic-commands.html

<pre>
%load_ext sql
%sql sqlite://
</pre>

In [ ]:
# load sql using line magic
%load_ext sql
%sql sqlite://

<pre>
%%sql
CREATE TABLE aTable
(
    pkey     INTEGER PRIMARY KEY,
    name     varchar(24)
);

CREATE TABLE bTable
(
    pkey     INTEGER PRIMARY KEY,
    name     varchar(24)
);

</pre>

In [ ]:
# create tables cell magic
%%sql
CREATE TABLE aTable
(
  pkey INTEGER PRIMARY KEY,
  name varchar(24)
);

CREATE TABLE bTable
(
  pkey INTEGER PRIMARY KEY,
  name varchar(24)
);

 * sqlite://
Done.
Done.

[]

<pre>
%%sql
INSERT INTO aTable (name)
VALUES ('Bugs Bunny'),
       ('Popeye'),
       ('Daffy Duck'),
       ('Mickey Mouse'),
       ('Minnie Mouse'),
       ('Tweety');

INSERT INTO bTable(name)
VALUES ('Bugs Bunny'),
       ('Charlie Brown'),
       ('Daffy Duck'),
       ('Homer Simpson'),
       ('Marge Simpson'),
       ('Tweety');
</pre>

In [ ]:
# populate tables
%%sql
INSERT INTO aTable (name)
VALUES ('Bugs Bunny'),
       ('Popeye'),
       ('Daffy Duck'),
       ('Mickey Mouse'),
       ('Minnie Mouse'),
       ('Tweety');

INSERT INTO bTable(name)
VALUES ('Bugs Bunny'),
       ('Charlie Brown'),
       ('Daffy Duck'),
       ('Homer Simpson'),
       ('Marge Simpson'),
       ('Tweety');

 * sqlite://
6 rows affected.
6 rows affected.

[]

<pre>
%%sql
SELECT * FROM sqlite_master;
</pre>

In [ ]:
# show sqlite master
%%sql
SELECT * FROM sqlite_master;

 * sqlite://
Done.

[('table', 'aTable', 'aTable', 2, 'CREATE TABLE aTable\n(\n  pkey INTEGER PRIMARY KEY,\n  name varchar(24)\n)'),
 ('table', 'bTable', 'bTable', 3, 'CREATE TABLE bTable\n(\n  pkey INTEGER PRIMARY KEY,\n  name varchar(24)\n)')]

<pre>
%%sql
SELECT * FROM aTable;
</pre>

In [ ]:
# select all from aTable
%%sql
SELECT * FROM aTable;

 * sqlite://
Done.

[(1, 'Bugs Bunny'),
 (2, 'Popeye'),
 (3, 'Daffy Duck'),
 (4, 'Mickey Mouse'),
 (5, 'Minnie Mouse'),
 (6, 'Tweety')]

<pre>
%%sql
SELECT * FROM bTable WHERE pkey = 1;
</pre>

In [ ]:
# select * from bTable where pkey = 1
%%sql
SELECT * FROM bTable WHERE pkey = 1;

 * sqlite://
Done.

[(1, 'Bugs Bunny')]

## JOINS

* https://www.w3schools.com/sql/sql_join.asp
* RIGHT and FULL OUTER JOINs are not currently supported in sqlite 3

<pre>
%%sql
SELECT * FROM aTable JOIN bTable USING (pkey);
</pre>

In [ ]:
# join aTable with bTable using pkey)
%%sql
SELECT * FROM aTable JOIN bTable USING (pkey);

 * sqlite://
Done.

[(1, 'Bugs Bunny', 'Bugs Bunny'),
 (2, 'Popeye', 'Charlie Brown'),
 (3, 'Daffy Duck', 'Daffy Duck'),
 (4, 'Mickey Mouse', 'Homer Simpson'),
 (5, 'Minnie Mouse', 'Marge Simpson'),
 (6, 'Tweety', 'Tweety')]

https://www.analyticsvidhya.com/blog/2024/01/role-of-underscore-in-python/

<pre>
result = _
df = result.DataFrame()
df.columns = ['pkey', 'aTable', 'bTable']
df.head()
</pre>

In [ ]:
# save output from previous cell and create a dataframe
result = _
df = result.DataFrame()
df.columns = ['pkey', 'aTable', 'bTable']
df.head()

   pkey        aTable         bTable
0     1    Bugs Bunny     Bugs Bunny
1     2        Popeye  Charlie Brown
2     3    Daffy Duck     Daffy Duck
3     4  Mickey Mouse  Homer Simpson
4     5  Minnie Mouse  Marge Simpson

## LEFT JOIN

Return all records from aTable and values that match from bTable. If no match, return null (None)

<pre>
%%sql
SELECT * FROM aTable
LEFT JOIN bTable
ON aTable.name = bTable.name;
</pre>

In [ ]:
# left join
%%sql
SELECT * FROM aTable
LEFT JOIN bTable
ON aTable.name = bTable.name;

 * sqlite://
Done.

[(1, 'Bugs Bunny', 1, 'Bugs Bunny'),
 (2, 'Popeye', None, None),
 (3, 'Daffy Duck', 3, 'Daffy Duck'),
 (4, 'Mickey Mouse', None, None),
 (5, 'Minnie Mouse', None, None),
 (6, 'Tweety', 6, 'Tweety')]

## LEFT JOIN WHERE

Return records from aTable and bTable based on some where condition

<pre>
%%sql
SELECT * FROM aTable
LEFT JOIN bTable
ON aTable.name = bTable.name
WHERE bTable.pkey IS not null;
</pre>

In [ ]:
# left join where
%%sql
SELECT * FROM aTable
LEFT JOIN bTable
ON aTable.name = bTable.name
WHERE bTable.pkey is not null;

 * sqlite://
Done.

[(1, 'Bugs Bunny', 1, 'Bugs Bunny'),
 (3, 'Daffy Duck', 3, 'Daffy Duck'),
 (6, 'Tweety', 6, 'Tweety')]

## INNER JOIN

Returns the set of records that match in both aTable and bTable

<pre>
%%sql
SELECT * FROM aTable
INNER JOIN bTable
ON aTable.name = bTable.name;
</pre>

In [ ]:
# inner join
%%sql
SELECT * FROM aTable
INNER JOIN bTable
ON aTable.name = bTable.name;

 * sqlite://
Done.

[(1, 'Bugs Bunny', 1, 'Bugs Bunny'),
 (3, 'Daffy Duck', 3, 'Daffy Duck'),
 (6, 'Tweety', 6, 'Tweety')]

## Using Aliases

<pre>
%%sql
SELECT a.pkey, a.name FROM aTable a, btable b WHERE a.name = b.name;
</pre>

In [ ]:
# use alias
%%sql
SELECT a.pkey, a.name as aName, b.name as bName FROM aTable a, bTable b WHERE a.name = b.name;

 * sqlite://
Done.

[(1, 'Bugs Bunny', 'Bugs Bunny'),
 (3, 'Daffy Duck', 'Daffy Duck'),
 (6, 'Tweety', 'Tweety')]

<pre>
%%sql
SELECT a.pkey, a.name FROM aTable a, btable b WHERE a.pkey = b.pkey and b.pkey = 1;
</pre>

In [ ]:
# select with alias where
%%sql
select a.pkey, a.name
from aTable a, bTable b
where a.pkey = b.pkey
and b.pkey = 1;

 * sqlite://
Done.

[(1, 'Bugs Bunny')]

## SQLite 3

In [ ]:
import sqlite3

connection = sqlite3.connect('looneylms.db') # sqlite will create looneylms.db if it doesn't exist,
                                             # a .db file now exists
cursor = connection.cursor()

In [ ]:
# multiline strings in Python can be sorrounded with ''' Multi line text '''
query = '''
CREATE TABLE IF NOT EXISTS people (
    id INTEGER PRIMARY KEY,
    firstname TEXT,
    lastname TEXT,
    year INTEGER
)
'''
cursor.execute(query)

In [ ]:
# populate people table
cursor.execute("INSERT INTO people(firstname, lastname, year) VALUES ('Bugs', 'Bunny', 1)")
cursor.execute("INSERT INTO people(firstname, lastname, year) VALUES ('Fifi', 'La Fume', 3)")
cursor.execute("INSERT INTO people(firstname, lastname, year) VALUES ('Daffy', 'Duck', 2)")
cursor.execute("INSERT INTO people(firstname, lastname, year) VALUES ('Foghorn', 'Leghorn', 1)")
cursor.execute("INSERT INTO people(firstname, lastname, year) VALUES ('Tweety', 'Bird', 4)")
cursor.execute("INSERT INTO people(firstname, lastname, year) VALUES ('Porky', 'Pig', 4)")

In [ ]:
rows = cursor.execute("SELECT * FROM people").fetchall()
print(rows)

In [ ]:
query = '''
CREATE TABLE IF NOT EXISTS quizzes (
    id INTEGER PRIMARY KEY,
    quizname TEXT,
    description TEXT
)
'''
cursor.execute(query)

In [ ]:
cursor.execute("INSERT INTO quizzes(quizname, description) VALUES ('Looney', 'quiz about laughing')")
cursor.execute("INSERT INTO quizzes(quizname, description) VALUES ('Tune', 'quiz about tunes')")

In [ ]:
rows = cursor.execute("SELECT * FROM quizzes").fetchall()
print(rows)

In [ ]:
query = '''
CREATE TABLE IF NOT EXISTS quiz_details (
    id INTEGER PRIMARY KEY,
    quizzes_id INTEGER,
    items INTEGER,
    FOREIGN KEY (quizzes_id)
      REFERENCES quizzes (id)
         ON DELETE NO ACTION
         ON UPDATE CASCADE
)
'''
cursor.execute(query)

In [ ]:
cursor.execute("INSERT INTO quiz_details(quizzes_id, items) VALUES (1, 10)")
cursor.execute("INSERT INTO quiz_details(quizzes_id, items) VALUES (2, 10)")

In [ ]:
rows = cursor.execute("SELECT * FROM quiz_details").fetchall()
print(rows)

In [ ]:
query = '''
CREATE TABLE IF NOT EXISTS quiz_results (
    id INTEGER PRIMARY KEY,
    quizzes_id INTEGER,
    people_id INTEGER,
    score INTEGER,
    FOREIGN KEY (people_id)
      REFERENCES people (id)
         ON DELETE NO ACTION
         ON UPDATE CASCADE,
    FOREIGN KEY (quizzes_id)
      REFERENCES quizzes (id)
         ON DELETE NO ACTION
         ON UPDATE CASCADE
)
'''
cursor.execute(query)

In [ ]:
cursor.execute("INSERT INTO quiz_results(quizzes_id, people_id, score) VALUES (1, 3, 7)")
cursor.execute("INSERT INTO quiz_results(quizzes_id, people_id, score) VALUES (2, 5, 8)")
cursor.execute("INSERT INTO quiz_results(quizzes_id, people_id, score) VALUES (2, 1, 9)")
cursor.execute("INSERT INTO quiz_results(quizzes_id, people_id, score) VALUES (1, 4, 8)")
cursor.execute("INSERT INTO quiz_results(quizzes_id, people_id, score) VALUES (2, 3, 7)")
cursor.execute("INSERT INTO quiz_results(quizzes_id, people_id, score) VALUES (1, 2, 8)")

In [ ]:
rows = cursor.execute("SELECT * FROM quiz_results").fetchall()
print(rows)

In [ ]:
query = '''
UPDATE people
SET id = 7
WHERE firstname = 'Daffy';
'''
cursor.execute(query)
rows = cursor.execute("SELECT * FROM people").fetchall()
print(rows)

In [ ]:
cursor.execute(query)
rows = cursor.execute("SELECT * FROM quiz_results").fetchall()
print(rows)

## Views

In [ ]:
query = '''
SELECT
    quizzes.quizname as quiz,
    people.firstname as firstname,
    people.lastname as lastname,
    quiz_results.score as score,
    people.year as year
FROM
    quiz_results
INNER JOIN people ON people.id = quiz_results.people_id
INNER JOIN quizzes ON quizzes.id = quiz_results.quizzes_id
ORDER BY quizzes.id;
'''
results = cursor.execute(query).fetchall()
for r in results:
    print(r)

In [ ]:
query = '''
CREATE VIEW quiz_takers
AS
SELECT
    quizzes.quizname as quiz,
    people.firstname as firstname,
    people.lastname as lastname,
    quiz_results.score as score,
    people.year as year
FROM
    quiz_results
INNER JOIN people ON people.id = quiz_results.people_id
INNER JOIN quizzes ON quizzes.id = quiz_results.quizzes_id
ORDER BY quizzes.id;
'''
cursor.execute(query)

In [ ]:
rows = cursor.execute("SELECT * FROM quiz_takers").fetchall()
for r in rows:
    print(r)

## Using Pandas

In [ ]:
# https://datacarpentry.org/python-ecology-lesson/09-working-with-sql/index.html
import pandas as pd

df = pd.read_sql_query("SELECT * FROM quiz_takers", connection)
print(df.head())

In [ ]:
from contextlib import closing

with closing(sqlite3.connect("looneylms.db")) as connection:
    with closing(connection.cursor()) as cursor:
        rows = cursor.execute("SELECT 1").fetchall()
        print(rows)

Start completely over

* Kernel Restart and clear output
* Delete looneylms.db
* Kernel Restart and run all

## SQLAlchemy

* SQLAlchemy provides a nice â€œPythonicâ€ way of interacting with databases. So rather than dealing with the differences between specific dialects of traditional SQL such as MySQL or PostgreSQL or Oracle, you can leverage the Pythonic framework of SQLAlchemy to streamline your workflow and more efficiently query your data.

https://towardsdatascience.com/sqlalchemy-python-tutorial-79a577141a91

## ORM

* ORM (Object Relational Mapping) is a programming technique for converting data between incompatible type systems in object-oriented programming languages. Usually, the type system used in an Object Oriented (OO) language like Python contains non-scalar types. These cannot be expressed as primitive types such as integers and strings. Hence, the OO programmer has to convert objects in scalar data to interact with backend database. However, data types in most of the database products such as Oracle, MySQL, etc., are primary. In an ORM system, each class maps to a table in the underlying database. Instead of writing tedious database interfacing code yourself, an ORM takes care of these issues for you while you can focus on programming the logics of the system.

https://www.tutorialspoint.com/sqlalchemy/sqlalchemy_introduction.htm

In [ ]:
# pip install sqlalchemy

In [ ]:
# how to connect to different databases https://www.tutorialspoint.com/sqlalchemy/sqlalchemy_core_connecting_to_database.htm
import pandas as pd
import sqlalchemy as db
from sqlalchemy.sql import select

print(db.__version__)

engine = db.create_engine('sqlite:///looneyalchemy.db') # creates a new database
connection = engine.connect()
metadata = db.MetaData()

# define people table
people = db.Table('people', metadata,
              db.Column('Id', db.Integer(), primary_key=True),
              db.Column('firstname', db.String(255)),
              db.Column('lastname', db.String(255)),
              db.Column('year', db.Integer())
              )

# create table
metadata.create_all(engine)

# insert data
query = db.insert(people).values(Id=1, firstname='Bugs', lastname='Bunny', year=4).prefix_with("OR IGNORE")
connection.execute(query)

query = db.insert(people).prefix_with("OR IGNORE")
values_list = [{'Id':'2', 'firstname': 'Tweety', 'lastname': 'Bird', 'year': 3},
               {'Id':'3', 'firstname': 'Daffy', 'lastname': 'Duck', 'year': 4}]
connection.execute(query, values_list)


metadata = db.MetaData()
people = db.Table('people', metadata, autoload=True, autoload_with=engine)

print('column keys:', people.columns.keys())
print()
print(repr(metadata.tables['people']))

# select * from people
query = db.select([people])
result = connection.execute(query)
rows = result.fetchall()
df = pd.DataFrame(rows)
df.columns = people.columns.keys()
print()
print(df.head())